nakhonthai/ESP32APRS_LoRa/src/main.cpp
/* Initialize PCNT functions for one channel:
 *  - configure and initialize PCNT with pos-edge counting
 *  - set up the input filter
 *  - set up the counter events to watch
 * Variables:
 * UNIT - Pulse Counter #, INPUT_SIG - Signal Input Pin, INPUT_CTRL - Control Input Pin,
 * Channel - Unit input channel, H_LIM - High Limit, L_LIM - Low Limit,
 * THRESH1 - configurable limit 1, THRESH0 - configurable limit 2,
 */
// void pcnt_init_channel(pcnt_unit_t PCNT_UNIT, int PCNT_INPUT_SIG_IO, bool ACTIVE = false, int PCNT_INPUT_CTRL_IO = PCNT_PIN_NOT_USED, pcnt_channel_t PCNT_CHANNEL = PCNT_CHANNEL_0, int PCNT_H_LIM_VAL = 65535, int PCNT_L_LIM_VAL = 0, int PCNT_THRESH1_VAL = 50, int PCNT_THRESH0_VAL = -50)
// {
//     /* Prepare configuration for the PCNT unit */
//     pcnt_config_t pcnt_config;
//     // Set PCNT input signal and control GPIOs
//     pcnt_config.pulse_gpio_num = PCNT_INPUT_SIG_IO;
//     pcnt_config.ctrl_gpio_num = PCNT_INPUT_CTRL_IO;
//     pcnt_config.channel = PCNT_CHANNEL;
//     pcnt_config.unit = PCNT_UNIT;
//     // What to do on the positive / negative edge of pulse input?
//     if (ACTIVE)
//     {
//         pcnt_config.pos_mode = PCNT_COUNT_INC; // Count up on the positive edge
//         pcnt_config.neg_mode = PCNT_COUNT_DIS; // Keep the counter value on the negative edge
//     }
//     else
//     {
//         pcnt_config.neg_mode = PCNT_COUNT_INC; // Count up on the positive edge
//         pcnt_config.pos_mode = PCNT_COUNT_DIS; // Keep the counter value on the negative edge
//     }
//     // What to do when control input is low or high?
//     pcnt_config.lctrl_mode = PCNT_MODE_REVERSE; // Reverse counting direction if low
//     pcnt_config.hctrl_mode = PCNT_MODE_KEEP;    // Keep the primary counter mode if high
//     // Set the maximum and minimum limit values to watch
//     pcnt_config.counter_h_lim = PCNT_H_LIM_VAL;
//     pcnt_config.counter_l_lim = PCNT_L_LIM_VAL;

//     /* Initialize PCNT unit */
//     pcnt_unit_config(&pcnt_config);
//     /* Configure and enable the input filter */
//     // pcnt_set_filter_value(PCNT_UNIT, 100);
//     // pcnt_filter_enable(PCNT_UNIT);

//     /* Set threshold 0 and 1 values and enable events to watch */
//     // pcnt_set_event_value(PCNT_UNIT, PCNT_EVT_THRES_1, PCNT_THRESH1_VAL);
//     // pcnt_event_enable(PCNT_UNIT, PCNT_EVT_THRES_1);
//     // pcnt_set_event_value(PCNT_UNIT, PCNT_EVT_THRES_0, PCNT_THRESH0_VAL);
//     // pcnt_event_enable(PCNT_UNIT, PCNT_EVT_THRES_0);
//     /* Enable events on zero, maximum and minimum limit values */
//     pcnt_event_enable(PCNT_UNIT, PCNT_EVT_ZERO);
//     pcnt_event_enable(PCNT_UNIT, PCNT_EVT_H_LIM);

//     /* Initialize PCNT's counter */
//     pcnt_counter_pause(PCNT_UNIT);
//     pcnt_counter_clear(PCNT_UNIT);
//     /* Register ISR handler and enable interrupts for PCNT unit */
//     // pcnt_isr_register(pcnt_intr_handler, NULL, 0, &user_isr_handle);
//     // pcnt_intr_enable(PCNT_UNIT);

//     /* Everything is set up, now go to counting */
//     pcnt_counter_resume(PCNT_UNIT);
//     // pcnt_counter_resume(PCNT_UNIT_1);
// }
// Pins
#define THERMISTORPIN 1

// Series resistor value
#define SERIESRESISTOR 10000
// Number of samples to average
#define SAMPLERATE 5

// Nominal resistance at 25C
#define THERMISTORNOMINAL 10000

// Nominal temperature in degrees
#define TEMPERATURENOMINAL 25

// Beta coefficient
#define BCOEFFICIENT 3950

double getTempNTC()
{
    double Vout;
    double thermalSamples[SAMPLERATE];
    double average, kelvin, resistance, celsius;
    int i;

    // Collect SAMPLERATE (default 5) samples
    for (i = 0; i < SAMPLERATE; i++)
    {
        thermalSamples[i] = analogReadMilliVolts(THERMISTORPIN);
        delay(10);
    }

    // Calculate the average value of the samples
    average = 0;

    for (i = 0; i < SAMPLERATE; i++)
    {
        average += thermalSamples[i];
    }

    Vout = average / SAMPLERATE;

    resistance = SERIESRESISTOR * Vout / (3300 - Vout);
    log_d("ADC=%0.fmV R=%0.1f", Vout, resistance);
    // Convert to resistanceresistance = 4095 / average - 1;resistance = SERIESRESISTOR/resistance;
    /*
     * Use Steinhart equation (simplified B parameter equation) to convert resistance to kelvin
     * B param eq: T = 1/( 1/To + 1/B * ln(R/Ro) )
     * T = Temperature in Kelvin
     * R = Resistance measured
     * Ro = Resistance at nominal temperature
     * B = Coefficent of the thermistor
     * To = Nominal temperature in kelvin
     */
    double R1 = 10000.0;  // voltage divider resistor value
    double Beta = 3950.0; // Beta value
    double To = 298.15;   // Temperature in Kelvin for 25 degree Celsius
    double Ro = 10000.0;  // Resistance of Thermistor at 25 degree Celsius

    double T = 1 / (1 / To + log(resistance / Ro) / Beta); // Temperature in Kelvin
    celsius = T - 273.15F;                                 // Celsius

    // kelvin = resistance / THERMISTORNOMINAL;               // R/Ro
    // kelvin = log(kelvin);                                  // ln(R/Ro)
    // kelvin = (1 / BCOEFFICIENT) * kelvin;                  // 1/B * ln(R/Ro)
    // kelvin = (1 / (TEMPERATURENOMINAL + 273.15)) + kelvin; // 1/To + 1/B * ln(R/Ro)
    // kelvin = 1 / kelvin;                                   // 1/( 1/To + 1/B * ln(R/Ro) )​

    // // Convert Kelvin to Celsius
    // celsius = kelvin - 273.15;

    // Send the value back to be displayed
    return celsius;
}

/* Count RPM Function - takes first timestamp and last timestamp,
number of pulses, and pulses per revolution */
int countRPM(int firstTime, int lastTime, int pulseTotal, int pulsePerRev)
{
    int timeDelta = (lastTime - firstTime); // lastTime - firstTime
    if (timeDelta <= 0)
    { // This means we've gotten something wrong
        return -1;
    }
    return ((60000 * (pulseTotal / pulsePerRev)) / timeDelta);
}

char EVENT_TX_POSITION = 0;
unsigned char SB_SPEED = 0, SB_SPEED_OLD = 0;
int16_t SB_HEADING = 0;
uint16_t tx_interval = 0, igate_tx_interval, digi_tx_interval; // How often we transmit, in seconds
unsigned int tx_counter, igate_tx_counter, digi_tx_counter;    // Incremented every second
int16_t last_heading, heading_change;                          // Keep track of corner pegging
uint16_t trk_interval = 15;

void smartbeacon(void)
{
    // Adaptive beacon rate
    if (SB_SPEED >= config.trk_hspeed)
    {
        tx_interval = (uint16_t)config.trk_maxinterval;
    }
    else
    {
        if (SB_SPEED <= config.trk_lspeed)
        {
            // Speed is below lower limit - use minimum rate
            tx_interval = (uint16_t)config.trk_slowinterval;
        }
        else
        {
            // In between, do SmartBeaconing calculations
            if (SB_SPEED <= 0)
                SB_SPEED = 1;
            tx_interval = (trk_interval * config.trk_hspeed) / SB_SPEED;
            if (tx_interval < 5)
                tx_interval = 5;
            if (tx_interval > config.trk_maxinterval)
                tx_interval = (uint16_t)config.trk_maxinterval;

            // Corner pegging - note that we use two-degree units
            if (last_heading > SB_HEADING)
                heading_change = last_heading - SB_HEADING;
            else
                heading_change = SB_HEADING - last_heading;
            if (heading_change > 90)
                heading_change = 180 - heading_change;
            if (heading_change > config.trk_minangle)
            {
                // Make sure last heading is updated during turns to avoid immedate xmit
                if ((tx_counter > config.trk_mininterval) && (SB_SPEED > 1))
                {
                    EVENT_TX_POSITION = 3;
                }
                else
                {
                    // last_heading = SB_HEADING;
                    tx_interval = config.trk_mininterval;
                }
            }
        }
    }
}

// (2^31 / 180) / 380926 semicircles per Base 91 unit
static unsigned long b91val[4] = {23601572L, 259358L, 2851L, 32L};
// Constants for converting lat/lon to semicircles
static long valtable[] = {1193046471L, 119304647L, 11930465L, 1988411L, 198841L, 19884L, 1988L, 199L, 20L, 2L};

// Takes degrees and fractional minutes and returns 2^31/180 degrees
// West and South values are negative
long semicircles(char *degstr, char hemi)
{
    char dgt = 0, *p;
    long ltemp = 0;
    if (degstr[4] == '.')
        dgt++; // Skip hundreds place if we know we're doing latitude
    p = degstr;
    for (; dgt < 10; p++)
    {
        if (*p == '.')
            continue;
        if (!isdigit(*p))
            break;
        ltemp += (*p & 0x0f) * valtable[dgt];
        dgt++;
    }
    if (hemi)
        return -ltemp;
    return ltemp;
}

// Converts semicircles to Base 91 units (must be properly biased first)
// Non-reentrant use of ltemp, but we only call this function in one place
void base91encode(long ltemp, char *s)
{
    // (2^31 / 180) / 380926 semicircles per Base 91 unit
    unsigned char c;

    for (c = 0; c < 4; c++)
    {
        s[c] = '!';
        while (ltemp >= b91val[c])
        {
            // reset_watchdog;
            ltemp -= b91val[c];
            s[c]++;
        }
    }
}

void telemetry_base91(char *cdata, char *output, size_t outputsize)
{
    int x, d1, d2;
    int i = 0;
    // Returns first token
    char *token = strtok(cdata, ",");
    output[i++] = '|';
    // Keep printing tokens while one of the
    // delimiters present in str[].
    while (token != NULL)
    {
        // printf(" % s\n", token);
        x = atoi(token);
        if(x>8280) x=8280;
        if(x<0) x=0;
        d1 = int(x / 91);
        d2 = x % 91;
        output[i++] = d1 + 33;
        output[i++] = d2 + 33;
        token = strtok(NULL, ",");
    }
    output[i++] = '|';
    outputsize = i;
}

/// Degrees to radians.
#define DEG2RAD(x) (x / 360 * 2 * PI)
/// Radians to degrees.
#define RAD2DEG(x) (x * (180 / PI))

double direction(double lon0, double lat0, double lon1, double lat1)
{
    double direction;

    /* Convert degrees into radians. */
    lon0 = DEG2RAD(lon0);
    lat0 = DEG2RAD(lat0);
    lon1 = DEG2RAD(lon1);
    lat1 = DEG2RAD(lat1);

