nakhonthai/ESP32APRS_LoRa/src/main.cpp
    // config.uart2_enable = false;
    // config.uart2_baudrate = 9600;
    // config.uart2_rx_gpio = 16;
    // config.uart2_tx_gpio = 17;
    // config.uart2_rts_gpio = -1;

    config.modbus_enable = false;
    config.modbus_de_gpio = -1;
    config.modbus_address = 0;
    config.modbus_channel = 0;

    config.onewire_enable = false;
    config.onewire_gpio = -1;

    config.pwr_en = false;
    config.pwr_mode = MODE_A;        // A=Continue,B=Wait for receive,C=Send and sleep
    config.pwr_sleep_interval = 600; // sec
    config.pwr_stanby_delay = 300;   // sec
    config.pwr_sleep_activate = ACTIVATE_TRACKER | ACTIVATE_WIFI;
    config.pwr_gpio = -1;

#ifdef OLED
    config.i2c_enable = true;
    config.i2c_sda_pin = 0;
    config.i2c_sck_pin = 1;
#else
    config.i2c_enable = false;
    config.i2c_sda_pin = -1;
    config.i2c_sck_pin = -1;
#endif

#ifdef TTGO_LORA32_V1
    config.rf_type = RF_SX1276;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 26;
    config.rf_reset_gpio = 14;
    config.rf_busy_gpio = -1;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
    config.uart0_rx_gpio = 3;
    config.uart0_tx_gpio = 1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 4;
    config.i2c_sck_pin = 15;
#elif defined(HT_CT62)
    config.rf_type = RF_SX1262;
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 3;
    config.rf_reset_gpio = 5;
    config.rf_busy_gpio = 4;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 10;
    config.rf_miso_gpio = 6;
    config.rf_mosi_gpio = 7;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_reset_active = 0;
    config.rf_nss_active = 0;
#elif defined(ESP32_DIY_LoRa_GPS) || defined(TTGO_T_LORA32_V2_1_GPS)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = -1;
    config.rf_reset_gpio = 23;
    config.rf_busy_gpio = -1;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_tx_gpio = 12;
    config.gnss_rx_gpio = 34;
#elif defined(TTGO_T_Beam_S3_SUPREME_V3)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 40;
    config.rf_reset_gpio = 5;
    config.rf_busy_gpio = 4;
    config.rf_nss_gpio = 10;
    config.rf_sclk_gpio = 12;
    config.rf_miso_gpio = 13;
    config.rf_mosi_gpio = 11;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 8;
    config.uart1_tx_gpio = 9;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 17;
    config.i2c_sck_pin = 18;
#elif defined(HELTEC_V3_GPS)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 14;
    config.rf_reset_gpio = 12;
    config.rf_busy_gpio = 13;
    config.rf_nss_gpio = 8;
    config.rf_sclk_gpio = 9;
    config.rf_miso_gpio = 11;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_tx_gpio = 20;
    config.gnss_rx_gpio = 19;
    config.i2c_enable = true;
    config.i2c_sda_pin = 17;
    config.i2c_sck_pin = 18;
    config.i2c_rst_pin = 21;
#elif defined(TTGO_T_Beam_V1_0_SX1268) || defined(TTGO_T_Beam_V1_2_SX1262)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 33;
    config.rf_reset_gpio = 23;
    config.rf_busy_gpio = 32;
    config.rf_nss_gpio = 18;
    config.rf_sclk_gpio = 5;
    config.rf_miso_gpio = 19;
    config.rf_mosi_gpio = 27;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_tx_gpio = 12;
    config.gnss_rx_gpio = 15;
    // config.i2c_enable = true;
    // config.i2c_sda_pin = 17;
    // config.i2c_sck_pin = 18;
    // config.i2c_rst_pin = 21;
#elif defined(APRS_LORA_HT)
    config.rf_tx_gpio = -1; // LORA ANTENNA TX ENABLE
    config.rf_rx_gpio = -1;
    config.rf_dio1_gpio = 45;
    config.rf_reset_gpio = 11;
    config.rf_busy_gpio = 14;
    config.rf_nss_gpio = 17;
    config.rf_sclk_gpio = 18;
    config.rf_miso_gpio = 8;
    config.rf_mosi_gpio = 10;
    config.rf_tx_active = 1;
    config.rf_rx_active = 1;
    config.rf_nss_active = 0;
    config.rf_reset_active = 0;
    config.gnss_enable = true;
    config.gnss_channel = 2;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 8;
    config.uart1_tx_gpio = 9;
    config.uart1_rts_gpio = -1;
    config.i2c_enable = true;
    config.i2c_sda_pin = 21;
    config.i2c_sck_pin = 47;    
    config.pwr_gpio = 41;
#endif

    config.i2c_freq = 400000;
    config.i2c1_enable = false;
    config.i2c1_sda_pin = -1;
    config.i2c1_sck_pin = -1;
    config.i2c1_freq = 100000;

    config.counter0_enable = false;
    config.counter0_active = 0;
    config.counter0_gpio = -1;

    config.counter1_enable = false;
    config.counter1_active = 0;
    config.counter1_gpio = -1;

    config.ext_tnc_enable = false;
    config.ext_tnc_channel = 0;
    config.ext_tnc_mode = 2;

    sprintf(config.path[0], "TRACE2-2");
    sprintf(config.path[1], "WIDE1-1");
    sprintf(config.path[2], "WIDE1-1,WIDE2-1");
    sprintf(config.path[3], "RFONLY");


#ifdef BUOY
    sprintf(config.wifi_ap_ssid, "BUOY");
    config.wifi_mode |= WIFI_AP_FIX;
    config.log |= 1;
    config.pwr_gpio = 2;
    sprintf(config.trk_symbol, "\\N");
    config.trk_gps = true;
    config.trk_loc2rf = true;
    config.trk_loc2inet = true;
    config.trk_smartbeacon = false;
    config.trk_compress = true;
    config.trk_en = true;
    config.trk_bat = true;
    config.trk_sat = false;
    config.trk_dx = false;
    config.trk_path = 2;
    config.trk_ssid = 11;
    config.trk_timestamp = false;
    sprintf(config.trk_mycall, "HS5TQA");
    sprintf(config.trk_item, "BTL0");
    config.trk_comment[0] = 0;
    config.rf_power = 22;
    config.uart1_enable = true;
    config.uart1_baudrate = 9600;
    config.uart1_rx_gpio = 19;
    config.uart1_tx_gpio = 18;
    config.uart1_rts_gpio = -1;
    config.gnss_enable = true;
    config.gnss_channel = 2;
#endif
    // if(strlen(config.trk_item)>3)
    //     sprintf(config.wifi_ap_ssid,"%s",config.trk_item);
    // else
    //     sprintf(config.wifi_ap_ssid,"%s-%d",config.trk_mycall,config.trk_ssid);

    saveEEPROM();
}

