nakhonthai/ESP32APRS_LoRa/src/main.cpp
uint8_t popGwRaw(uint8_t *raw)
{
    uint8_t size = 0;
    if (gwRaw_count <= 0)
        return 0;
    if (++gwRaw_idx_rd >= PKGLISTSIZE)
        gwRaw_idx_rd = 0;
    size = gwRawSize[gwRaw_idx_rd];
    memcpy(raw, &gwRaw[gwRaw_idx_rd][0], size);
    if (gwRaw_count > 0)
        gwRaw_count--;
    return size;
}

WiFiClient aprsClient;

boolean APRSConnect()
{
    // Serial.println("Connect TCP Server");
    String login = "";
    int cnt = 0;
    uint8_t con = aprsClient.connected();
    // Serial.println(con);
    if (con <= 0)
    {
        if (!aprsClient.connect(config.aprs_host, config.aprs_port)) // เชื่อมต่อกับเซิร์ฟเวอร์ TCP
        {
            // Serial.print(".");
            delay(100);
            cnt++;
            if (cnt > 50) // วนร้องขอการเชื่อมต่อ 50 ครั้ง ถ้าไม่ได้ให้รีเทิร์นฟังค์ชั่นเป็น False
                return false;
        }
        // ขอเชื่อมต่อกับ aprsc
        if (strlen(config.igate_object) >= 3)
        {
            uint16_t passcode = aprsParse.passCode(config.igate_object);
            login = "user " + String(config.igate_object) + " pass " + String(passcode, DEC) + " vers ESP32IGate V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.aprs_filter);
        }
        else
        {
            uint16_t passcode = aprsParse.passCode(config.aprs_mycall);
            if (config.aprs_ssid == 0)
                login = "user " + String(config.aprs_mycall) + " pass " + String(passcode, DEC) + " vers ESP32IGate V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.aprs_filter);
            else
                login = "user " + String(config.aprs_mycall) + "-" + String(config.aprs_ssid) + " pass " + String(passcode, DEC) + " vers ESP32IGate V" + String(VERSION) + String(VERSION_BUILD) + " filter " + String(config.aprs_filter);
        }
        aprsClient.println(login);
        // Serial.println(login);
        // Serial.println("Success");
        delay(500);
    }
    return true;
}

long oledSleepTimeout = 0;
bool showDisp = false;
uint8_t curTab = 0;

void preTransmission()
{
    digitalWrite(config.modbus_de_gpio, 1);
}

void postTransmission()
{
    digitalWrite(config.modbus_de_gpio, 0);
}

// 3 seconds WDT
#define WDT_TIMEOUT 10

bool AFSKInitAct = false;
unsigned long timeTask;
void setup()
{
    byte *ptr;

#ifdef BOARD_HAS_PSRAM
    pkgList = (pkgListType *)ps_malloc(sizeof(pkgListType) * PKGLISTSIZE);
    Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
    txQueue = (txQueueType *)ps_malloc(sizeof(txQueueType) * PKGTXSIZE);
    // TNC2Raw = (int *)ps_malloc(sizeof(int) * PKGTXSIZE);
#else
    pkgList = (pkgListType *)malloc(sizeof(pkgListType) * PKGLISTSIZE);
    Telemetry = (TelemetryType *)malloc(sizeof(TelemetryType) * TLMLISTSIZE);
    txQueue = (txQueueType *)malloc(sizeof(txQueueType) * PKGTXSIZE);
    // TNC2Raw = (int *)malloc(sizeof(int) * PKGTXSIZE);
#endif

    memset(pkgList, 0, sizeof(pkgListType) * PKGLISTSIZE);
    memset(Telemetry, 0, sizeof(TelemetryType) * TLMLISTSIZE);
    memset(txQueue, 0, sizeof(txQueueType) * PKGTXSIZE);

    //pinMode(9, INPUT_PULLUP); // BOOT Button
    pinMode(LED_RX, OUTPUT);
    pinMode(LED_TX, OUTPUT);

    pinMode(0, INPUT);
    pinMode(1, INPUT);

    // Set up serial port
#ifdef CORE_DEBUG_LEVEL
    Serial.begin(115200); // debug
#else
    Serial.begin(9600); // monitor
#endif

    if (!LITTLEFS.begin(FORMAT_LITTLEFS_IF_FAILED))
    {
        log_d("LITTLEFS Mount Failed");
        // return;
    }
    else
    {
        log_d("File system mounted");
        log_d("Total space: %lu\n", LITTLEFS.totalBytes());
        log_d("Use space:  %lu\n\n", LITTLEFS.usedBytes());
    }

    log_d("Start ESP32IGate V%s", VERSION);
    // log_d("Push BOOT after 3 sec for Factory Default config.");

    if (!EEPROM.begin(EEPROM_SIZE))
    {
        log_d("failed to initialise EEPROM"); // delay(100000);
    }
    // ตรวจสอบคอนฟิกซ์ผิดพลาด
    ptr = (byte *)&config;
    EEPROM.readBytes(1, ptr, sizeof(Configuration));
    uint8_t chkSum = checkSum(ptr, sizeof(Configuration));
    log_d("EEPROM Check %0Xh=%0Xh(%dByte)\n", EEPROM.read(0), chkSum, sizeof(Configuration));
    if (EEPROM.read(0) != chkSum || EEPROM.read(0)==0)
    {
        log_d("CRC EEPROM Error!");
        log_d("Factory Default");
        defaultConfig();
    }

#ifdef BUOY
    config.wifi_mode |= WIFI_AP_FIX;
    pinMode(9,OUTPUT_OPEN_DRAIN);
    digitalWrite(9,LOW);
    timeLEDoff=500;
    timeLEDon=10;
#else
    pinMode(BOOT_PIN,INPUT_PULLUP);    
#endif
  
    Sleep_Activate = config.pwr_sleep_activate;
    pinMode(config.pwr_gpio, OUTPUT);
    digitalWrite(config.pwr_gpio, HIGH);

    if (config.i2c1_enable)
    {
        Wire1.begin(config.i2c1_sda_pin, config.i2c1_sck_pin, config.i2c1_freq);
    }

#ifdef OLED
    config.i2c_enable = true;
    // pinMode(OLED_RESET,OUTPUT);
    // digitalWrite(OLED_RESET,HIGH);
    // delay(300);
    Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);

    // by default, we'll generate the high voltage from the 3.3v line internally! (neat!)
    if (OLED_RESET > -1)
    {
        display.begin(SSD1306_SWITCHCAPVCC, 0x3C, true, false); // initialize with the I2C addr 0x3C (for the 128x64)
    }
    else
    {
        display.begin(SSD1306_SWITCHCAPVCC, 0x3C, false, false); // initialize with the I2C addr 0x3C (for the 128x64)
    }
    // Initialising the UI will init the display too.
    display.clearDisplay();
    display.setTextSize(1);
    display.setTextColor(WHITE);

    if (config.pwr_mode == MODE_A)
    {
        display.setTextSize(1);
        display.setFont(&FreeSansBold9pt7b);
        display.setCursor(0, 15);
        display.print("APRS");
        display.setCursor(60, 32);
        display.print("I-GATE");
        display.drawYBitmap(0, 16, LOGO, 48, 48, WHITE);
        display.drawRoundRect(52, 16, 75, 22, 3, WHITE);

        display.setFont();
        display.setTextColor(WHITE);

        display.setCursor(60, 40);
        display.printf("FW Ver %s%c", VERSION, VERSION_BUILD);
        display.setCursor(65, 5);
        display.print("Copy@2022");
        display.display();

        delay(1000);
        digitalWrite(LED_TX, HIGH);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("3 Sec");
        display.display();
        delay(1000);
        digitalWrite(LED_RX, HIGH);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("2 Sec");
        display.display();
        delay(1000);
        display.fillRect(49, 49, 50, 8, 0);
        display.setCursor(70, 50);
        display.print("1 Sec");
        display.display();
        delay(1000);
    }
    display.setFont();
    display.setTextColor(WHITE);
#else
    if (config.i2c_enable)
    {
        Wire.begin(config.i2c_sda_pin, config.i2c_sck_pin, config.i2c_freq);
    }
    if (config.pwr_mode != MODE_A)
    {
        delay(1000);
        digitalWrite(LED_TX, HIGH);
        delay(1000);
        digitalWrite(LED_RX, HIGH);
        delay(1000);
    }
#endif
    if (config.pwr_mode != MODE_A)
    {
//         if (digitalRead(9) == LOW)
//         {
//             defaultConfig();
//             log_d("Manual Default configure!");
// #ifdef OLED
//             display.clearDisplay();
//             display.setCursor(10, 22);
//             display.print("Factory Reset!");
//             display.display();
// #endif
//             while (digitalRead(9) == LOW)
//             {
//                 delay(500);
//                 digitalWrite(LED_TX, LOW);
//                 digitalWrite(LED_RX, LOW);
//                 delay(500);
//                 digitalWrite(LED_TX, HIGH);
//                 digitalWrite(LED_RX, HIGH);
//             }
//         }
        digitalWrite(LED_TX, LOW);
        digitalWrite(LED_RX, LOW);
    }

