nakhonthai/ESP32APRS_LoRa/src/main.cpp
String digi_position(double lat, double lon, double alt, String comment)
{
    String tnc2Raw = "";
    int lat_dd, lat_mm, lat_ss, lon_dd, lon_mm, lon_ss;
    char strtmp[500], loc[100];
    char lon_ew = 'E';
    char lat_ns = 'N';
    if (lat < 0)
        lat_ns = 'S';
    if (lon < 0)
        lon_ew = 'W';
    memset(strtmp, 0, sizeof(strtmp));
    memset(loc, 0, sizeof(loc));
    DD_DDDDDtoDDMMSS(lat, &lat_dd, &lat_mm, &lat_ss);
    DD_DDDDDtoDDMMSS(lon, &lon_dd, &lon_mm, &lon_ss);
    char strAltitude[12];
    memset(strAltitude, 0, sizeof(strAltitude));
    if (alt > 0)
    {
        sprintf(strAltitude, "/A=%06d", (int)(alt * 3.28F));
    }
    if (config.digi_timestamp)
    {
        String timeStamp = getTimeStamp();
        sprintf(loc, "/%s%02d%02d.%02d%c%c%03d%02d.%02d%c%c", timeStamp, lat_dd, lat_mm, lat_ss, lat_ns, config.digi_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.digi_symbol[1]);
    }
    else
    {
        sprintf(loc, "!%02d%02d.%02d%c%c%03d%02d.%02d%c%c", lat_dd, lat_mm, lat_ss, lat_ns, config.digi_symbol[0], lon_dd, lon_mm, lon_ss, lon_ew, config.digi_symbol[1]);
    }
    if (config.digi_ssid == 0)
        sprintf(strtmp, "%s>APE32L", config.digi_mycall);
    else
        sprintf(strtmp, "%s-%d>APE32L", config.digi_mycall, config.digi_ssid);
    tnc2Raw = String(strtmp);
    if (config.digi_path < 5)
    {
        if (config.digi_path > 0)
            tnc2Raw += "-" + String(config.digi_path);
    }
    else
    {
        tnc2Raw += ",";
        tnc2Raw += getPath(config.digi_path);
    }
    tnc2Raw += ":";
    tnc2Raw += String(loc);
    tnc2Raw += String(config.digi_phg) + String(strAltitude);
    tnc2Raw += comment + " " + String(config.digi_comment);
    return tnc2Raw;
}

int packet2Raw(String &tnc2, AX25Msg &Packet)
{
    if (Packet.len < 5)
        return 0;
    tnc2 = String(Packet.src.call);
    if (Packet.src.ssid > 0)
    {
        tnc2 += String(F("-"));
        tnc2 += String(Packet.src.ssid);
    }
    tnc2 += String(F(">"));
    tnc2 += String(Packet.dst.call);
    if (Packet.dst.ssid > 0)
    {
        tnc2 += String(F("-"));
        tnc2 += String(Packet.dst.ssid);
    }
    for (int i = 0; i < Packet.rpt_count; i++)
    {
        tnc2 += String(",");
        tnc2 += String(Packet.rpt_list[i].call);
        if (Packet.rpt_list[i].ssid > 0)
        {
            tnc2 += String("-");
            tnc2 += String(Packet.rpt_list[i].ssid);
        }
        if (Packet.rpt_flags & (1 << i))
            tnc2 += "*";
    }
    tnc2 += String(F(":"));
    tnc2 += String((const char *)Packet.info);

    return tnc2.length();
}

uint8_t led_pin=9;
// Declare an array named letters that holds addresses of string literals 
// (i.e. an array of pointers to strings composed of dots and dashes) 
// Done to preserve memory because strings are not equal in size. A 2D array
// would be a waste of space.
char *letters[] = {
  // The letters A-Z in Morse code  
  ".-", "-...", "-.-.", "-..", ".", "..-.", "--.", "....", "..",    
  ".---", "-.-", ".-..", "--", "-.", "---", ".--.", "--.-", ".-.",  
  "...", "-", "..-", "...-", ".--", "-..-", "-.--", "--.."         
};
 
char *numbers[] = {
  // The numbers 0-9 in Morse code  
  "-----", ".----", "..---", "...--", "....-", ".....", "-....", 
  "--...", "---..", "----."
};
 
unsigned int dot_duration = 100;
bool done = false;

/**
  *  Flashes the dot or dash in the Morse code
  *  @param dot_or_dash character that is a dot or a dash
  */
void flash_dot_or_dash(char dot_or_dash) {
   
  // Make the LED shine
  digitalWrite(led_pin, LOW);
   
  if (dot_or_dash == '.') { // If it is a dot
    //delay(dot_duration);           
    vTaskDelay(dot_duration / portTICK_PERIOD_MS);
  }
  else { // Has to be a dash...equal to three dots
    //delay(dot_duration * 3);           
    vTaskDelay(dot_duration * 3 / portTICK_PERIOD_MS);
  }
   
  // Turn the LED off
  digitalWrite(led_pin, HIGH);
 
  // Give space between parts of the same letter...equal to one dot
  //delay(dot_duration); 
  vTaskDelay(dot_duration / portTICK_PERIOD_MS);
}

/**
  *  Flashes the Morse code for the input letter or number
  *  @param morse_code pointer to the morse code
  */
void flash_morse_code(char *morse_code) {
    
  unsigned int i = 0;
    
  // Read the dots and dashes and flash accordingly
  while (morse_code[i] != NULL) {
    flash_dot_or_dash(morse_code[i]);
    i++;
    if(i>7) break;
  }
    
  // Space between two letters is equal to three dots
  //delay(dot_duration * 3);    
  vTaskDelay(dot_duration * 3 / portTICK_PERIOD_MS);
}
 
void flash_morse_text(char *text,size_t len)
{
    char ch;
    for(int i=0;i<len;i++){
        ch=text[i];
    // Check for uppercase letters
      if (ch >= 'A' && ch <= 'Z') {
        //Serial.println(ch);
        flash_morse_code(letters[ch - 'A']);        
      }
      // Check for lowercase letters
      else  if (ch >= 'a' && ch <= 'z') {
        //Serial.println(ch);
        flash_morse_code(letters[ch - 'a']);
      }
      // Check for numbers
      else if (ch >= '0' && ch <= '9') {
        //Serial.println(ch);
        flash_morse_code(numbers[ch - '0']);
      }
      // Check for space between words
      else if (ch == ' ') {       
        // Put space between two words in a message...equal to seven dots
        //delay(dot_duration * 7);       
        vTaskDelay(dot_duration * 7 / portTICK_PERIOD_MS);
      }

#ifndef TTGO_T_Beam_S3_SUPREME_V3
        esp_task_wdt_reset();
#endif
    }
}

long sendTimer = 0;
int btn_count = 0;
long timeCheck = 0;
int timeHalfSec = 0;

unsigned long timeSec;

char nmea[100];
int nmea_idx = 0;
char morse[50];
uint8_t morseState=0;

void loop()
{
    if (millis() > timeTask)
    {
        timeTask = millis() + 10000;
#ifdef BUOY
        VBat = (double)analogReadMilliVolts(0) / 595.24F;
        TempNTC = getTempNTC();
        
        // if (WiFi.isConnected() || WiFi.softAPgetStationNum()){
        //     sprintf(morse,"B%dT%dS%dW",(int)(VBat*100),(int)(TempNTC*100),gps.satellites.value());
        //     if(WiFi.softAPgetStationNum()) strcat(morse,"A");
        //     if(WiFi.isConnected()) strcat(morse,"S");
        //     //strcat(morse," ");
        // }else{
        //     sprintf(morse," B%dT%dS%d ",(int)(VBat*100),(int)(TempNTC*100),gps.satellites.value());
        // }
        morseState++;
        if(morseState==1){
            sprintf(morse,"B%d",(int)(VBat*100));
        }else if(morseState==2){
            sprintf(morse,"T%d",(int)(TempNTC*100));    
        }else if(morseState==3){
            sprintf(morse,"S%d",gps.satellites.value());    
        }else if(morseState>5){
            morseState=0;
        }
        if(morseState>0 && morseState<4) flash_morse_text(morse,strlen(morse));

        if(VBat<3.3F){
            digitalWrite(config.pwr_gpio, LOW);
            if(VBat<3.0F){
                esp_sleep_enable_timer_wakeup(600 * uS_TO_S_FACTOR);
                esp_deep_sleep_start();
            }
        }    
#endif
        log_d("Task process APRS=%iuS\t NETWORK=%iuS\t GPS=%iuS\t SERIAL=%iuS\n", timerAPRS, timerNetwork, timerGPS, timerSerial);
        log_d("Free heap: %s KB \tWiFi:%s ,RSSI:%s dBm ,BAT: %0.3fV ,Temp: %0.2fC", String((float)ESP.getFreeHeap() / 1000, 1).c_str(), String(WiFi.SSID()).c_str(), String(WiFi.RSSI()).c_str(), VBat, TempNTC);
        if (WiFi.isConnected() == false && WiFi.softAPgetStationNum() == 0)
        {
            Sleep_Activate &= ~ACTIVATE_WIFI;
        }
    }

#ifdef BUOY
        if(gps.location.isValid() && gps.location.isUpdated()){
            if(VBat>4.1F)
                sprintf(morse,"U "); //Bat Full & GPS
            else
                sprintf(morse,"I ");
        }else{
            if(VBat>4.1F)
                sprintf(morse,"A "); //Bat Full & NoGPS
            else
                sprintf(morse,"E ");
        }
        flash_morse_text(morse,strlen(morse));
#endif

    vTaskDelay(10 / portTICK_PERIOD_MS);

#ifdef BLUETOOTH
    if (config.bt_master)
        Bluetooth();
#endif

